import { object, string, ref } from "yup";

const schema = object().shape({
   fullname: string()
      .required("نام و نام خانوادگی الزامی میباشد!")
      .min(4, "نام و نام خانوادگی نباید کمتر از 4 کاراکتر باشد!")
      .max(255, "نام و نام خانوادگی نباید بیشتر از 255 کاراکتر باشد!"),
   email: string().email("ایمیل وارد شده معتبر نمیباشد!").required("ایمیل الزامی میباشد!"),
   password: string()
      .min(4, "کلمه عبور نباید کمتر از 4 کاراکتر باشد!")
      .max(255, "کلمه عبور نباید بیشتر از 255 کراکتر باشد!")
      .required("کلمه عبور الزامی میباشد!"),
   confirmPassword: string()
      .required("تکرار کلمه عبور الزامی میباشد!")
      .min(4, "تکرار کلمه عبور نباید کمتر از 4 کراکتر باشد!")
      .max(255, "تکرار کلمه عبور نباید بیشتر از 255 کراکتر باشد!")
      .oneOf([ref("password"), null], "تکرار کلمه عبور و کلمه عبور یکسان نیستند!"),
});

export default schema;
